import React, { useState, useEffect } from "react";
import { useParams } from "react-router-dom";
import Navbar from "../../components/navbar";
import Footer from "../../components/Footer";

const topicsDetails = {
  1: {
    title:
      "بررسی چالش‌های افزایش امنیت اجتماعی در فضاهای شهری قم و ارائه راهکارهای مناسب",
    serviceDetails: [
      {
        section: "کلیات و پیشینه پژوهش",
        items: [
          "بیان مسئله، اهمیت و ضرورت و روش انجام پژوهش",
          "بررسی ادبیات مسئله امنیت اجتماعی در قم و وضع موجود",
          "بررسی تجارب دیگر شهرهای داخلی و خارجی",
        ],
      },
      {
        section: "گردآوری اطلاعات و تحلیل مسئله",
        items: [
          "شناسایی شاخص‌های امنیت اجتماعی",
          "شناسایی فضاهای شهری دارای مشکل امنیت اجتماعی در شهر قم",
          "بررسی تطبیقی مشکلات، تهدیدها و آسیب‌های اجتماعی موجود در آنها",
          "بررسی وضعیت احساس امنیت و سطح انتظار و چگونگی اثرگذاری آن در شهر در مردم‌سنجی‌ها",
          "گزارش‌ها و مستندات",
        ],
      },
      {
        section: "نتیجه‌گیری و ارائه راهکارهای کاربردی و عملیاتی",
        items: [
          "امکان‌سنجی و ارزیابی اثرگذاری راهکارها با توجه به هزینه‌های مالی و تبعات اجتماعی و دیگر مسائل",
          "ارائه راهکارهای مناسب جهت حل مشکلات و افزایش امنیت اجتماعی در این فضاها",
          "ارائه راهکارهای مناسب جهت ارتقاء احساس امنیت اجتماعی در این فضاها",
          "تدوین پیشنهادها و راهکارها",
        ],
      },
      {
        section: "خروجی",
        items: ["ارائه گزارش نتایج و تهیه خلاصه مدیریتی"],
      },
    ],
  },

  2: {
    title:
      "بررسی وضعیت موجود مشاغل مرتبط با خیابان‌های خودرو (تعمیرگاه‌ها) و ارائه راهکارهای مناسب جهت ساماندهی",
    serviceDetails: [
      {
        section: "کلیات و پیشینۀ پژوهش",
        items: [
          "بیان مسئله، اهمیت و ضرورت و روش انجام پژوهش",
          "بررسی پیشینۀ مسئله در شهر قم و وضع موجود",
          "بررسی تجارب دیگر شهرهای داخلی و خارجی",
        ],
      },
      {
        section: "گردآوری اطلاعات و تحلیل مسئله",
        items: [
          "تبیین مفهوم مبلغاگر مرتبط با خدمات خودرو (تعمیرگاه ها) و بررسی اثرات مثبت و منفی آن در شهر قم",
          "بررسی وضعیت موجود مشاغل مرتبط با خدمات خودرو (تعمیرگاه ها) با توجه به مناطق سپاری قم",
          "تبیین اهداف مورد انتظار و بین‌بینی چگونگی اثرگذاری آن بر شهر در دوره‌های گونه میان و بلندمدت",
        ],
      },
      {
        section: "نتیجه‌گیری و ارائه راهکارهای کاربردی و عملیاتی",
        items: [
          "بررسی راهکارهای متاسابه‌الزای سامانه‌می مشاغل مرتبط با خدمات خودرو (تعمیرگاه ها) با مواجهه با کمترین تبعات اجتماعی",
          "امکان‌سنجی و ارزیابی اجرای راهکارها با توجه به برنامه‌های مالی و تبعات اجتماعی و دیگر مسائل",
          "اولویت‌بندی راهکارها",
        ],
      },
      {
        section: "خروجی",
        items: ["ارائه گزارش نتایج و تهیه خلاصۀ مدیریتی"],
      },
    ],
  },

  3: {
    title: "ارائه بسته‌های حمایتی طرح جوانی جمعیت (شهروندان کلانشهر قم)",
    serviceDetails: [
      {
        section: "کلیات و پیشینه پژوهش",
        items: [
          "بیان مسئله، اهمیت و ضرورت و روش انجام پژوهش",
          "بررسی پیشینه مسئله در شهر قم و وضع موجود",
          "بررسی تجارب دیگر شهرهای داخلی و خارجی",
        ],
      },
      {
        section: "گردآوری اطلاعات و تحلیل مسئله",
        items: [
          "شناسایی و تحلیل مستندات و ضوابط مرتبط با جوانی جمعیت (مستندات خارجی و داخلی موجود)",
          "شناسایی اقدامات حاضر تشویق جوانی جمعیت در شهر قم",
          "ظرفیت‌سنجی زمینه مشوقات جوانی جمعیت در شهر قم",
        ],
      },
      {
        section: "نتیجه‌گیری و ارائه راهکارهای کاربردی و عملیاتی",
        items: [
          "اولویت‌بندی رویکردهای ممکن در شهرداری قم",
          "اولویت‌بندی رویکردهای اجرایی در شهر قم",
          "ارائه بسته پیشنهادی متنوع جوانی جمعیت در شهرداری قم",
          "ارائه بسته پیشنهادی متنوع جوانی جمعیت در شهر قم",
          "امکان‌سنجی و ارزیابی ابزارها با توجه به هزینه‌های مالی و تبعات اجتماعی و دیگر مسائل",
          "اولویت‌بندی راهکارها",
        ],
      },
      {
        section: "خروجی",
        items: [
          "ارائه گزارش نتایج و تهیه خلاصه مدیریتی",
          "ارائه بسته‌های پیشنهادی متنوع",
        ],
      },
    ],
  },

  4: {
    title: "تعریف جامع مفهوم هویت شهری قم: شرح و بسط",
    serviceDetails: [
      {
        section: "کلیات و پیشینۀ پژوهش",
        items: [
          "بیان مسئله، اهمیت و ضرورت و روش انجام پژوهش",
          "بررسی پیشینۀ مسئله در شهر قم و وضع موجود",
          "بررسی تجارب دیگر شهرهای داخلی و خارجی",
        ],
      },
      {
        section: "گردآوری اطلاعات و تحلیل مسئله",
        items: [
          "بررسی و تبیین دستیابی به مفهوم هویت شهری و تعریف هویت شهری قم",
          "تبیین اثرات متصور، حاصل از تعریف دقیق هویت شهری قم",
        ],
      },
      {
        section: "نتیجه‌گیری و ارائه راهکارهای کاربردی و عملیاتی",
        items: [
          "امکان‌سنجی و ارزیابی اجرای راهکارها با توجه به هزینه‌های مالی و تبعات اجتماعی و دیگر مسائل",
          "اولویت‌بندی راهکارها",
        ],
      },
      {
        section: "خروجی",
        items: ["ارائه گزارش نتایج و تهیه خلاصۀ مدیریتی"],
      },
    ],
  },

  5: {
    title:
      "تعیین شاخص‌های سنجش تعلق خاطر شهروندان به شهر و ارائه راهکارهای مناسب فرهنگی و اجتماعی",
    serviceDetails: [
      {
        section: "کلیات و پیشینه پژوهش",
        items: [
          "بیان مسئله، اهمیت و ضرورت و روش انجام پژوهش",
          "بررسی پیشینه مسئله در شهر قم و وضع موجود",
          "بررسی تجارب دیگر شهرهای داخلی و خارجی",
        ],
      },
      {
        section: "گردآوری اطلاعات و تحلیل مسئله",
        items: [
          "بررسی وضعیت فعلی تعلق خاطر شهروندان به فضای شهری قم",
          "تعیین شاخص‌های قابل سنجش برای تعلق خاطر",
          "تعیین اهداف مورد انتظار و پیش بینی چگونگی اثرگذاری بر شهر در دوره‌های کوتاه، میان و بلندمدت",
        ],
      },
      {
        section: "نتیجه‌گیری و ارائه راهکارهای کاربردی و عملیاتی",
        items: [
          "پیشنهاد ابزارهای سنجش تعلق خاطر و دوره‌های تکرار",
          "ارائه راهکارهای کاربردی برای افزایش تعلق خاطر در قالب یک برنامه جامع",
          "فرآیند اجرای اقدامات مؤلفه‌ای",
          "امکان‌سنجی و ارزیابی اجرای راهکارها با توجه به هزینه‌های مالی و تبعات اجتماعی و دیگر مسائل",
          "اولویت‌بندی راهکارها",
        ],
      },
      {
        section: "خروجی",
        items: ["ارائه گزارش نتایج و تهیه خلاصه مدیریتی"],
      },
    ],
  },
  6: {
    title:
      "تهیه برنامه عملیاتی توسعه گردشگری مذهبی شهر قم با تمرکز بر استفاده از ظرفیت‌های استفاده‌شده و ارائه راهکار جهت تامین کمبودها در ملزومات و پیش‌نیازهای توسعه گردشگری مذهبی",
    serviceDetails: [
      {
        section: "کلیات و پیشینه پژوهش",
        items: [
          "بیان مسئله، اهمیت و ضرورت و روش انجام پژوهش",
          "بررسی پیشینه مسئله در شهر قم و وضع موجود",
          "بررسی تجارب دیگر شهرهای داخلی و خارجی",
        ],
      },
      {
        section: "گردآوری اطلاعات و تحلیل مسئله",
        items: [
          "بررسی وضعیت موجود ظرفیت گردشگری شهر قم و میزان تحقق این ظرفیت با رویکرد سیستمی",
          "تعیین اهداف مورد انتظار و پیش‌بینی چگونگی اثرگذاری آن بر شهر در دوره‌های کوتاه، میان و بلندمدت",
          "بررسی زیرساخت‌ها و ملزومات تحقق استفاده بهینه از ظرفیت‌های موجود",
          "بررسی فضاهای اقتصادی و ارزش افزوده گردشگری شهر قم با رویکرد سیستمی",
          "نقش سازمان‌های دخیل در امر ارائه خدمات گردشگری در مدیریت مقصد",
        ],
      },
      {
        section: "نتیجه‌گیری و ارائه راهکارهای کاربردی و عملیاتی",
        items: [
          "ارائه راهکارهای مناسب با توجه به شرایط موجود",
          "امکان‌سنجی و ارزیابی اجرای راهکارها با توجه به هزینه‌های مالی و تبعات اجتماعی و دیگر مسائل",
          "تهیه بسته‌ای از اقدامات لازم مدیریت شهری برای استفاده بهینه از ظرفیت‌های گردشگری",
          "اولویت‌بندی و فازبندی اجرایی راهکارها",
        ],
      },
      {
        section: "خروجی",
        items: ["ارائه گزارش نتایج و تهیه خلاصه مدیریتی"],
      },
    ],
  },

  7: {
    title:
      "شناسایی ظرفیت‌های مغفول‌مانده مذهبی شهر قم با تمرکز بر حرم حضرت معصومه (س) و مسجد مقدس جمکران و پیشنهادهای مناسب جهت به کارگیری این ظرفیت‌ها در مدیریت شهری",
    serviceDetails: [
      {
        section: "کلیات و پیشینه پژوهش",
        items: [
          "بیان مسئله، اهمیت و ضرورت و روش انجام پژوهش",
          "بررسی پیشینه مسئله در شهر قم و وضع موجود",
          "بررسی تجارب دیگر شهرهای داخلی و خارجی",
        ],
      },
      {
        section: "گردآوری اطلاعات و تحلیل مسئله",
        items: [
          "تهیه فهرست کلی ظرفیت‌های مذهبی شهر قم در ابعاد مختلف",
          "تعیین نقش و وظیفه هر یک از دستگاه‌ها در تحقق حداکثری این ظرفیت",
          "تعیین اهداف مورد انتظار و چگونگی اثرگذاری بر شهر در دوره‌های کوتاه، میان و بلندمدت",
        ],
      },
      {
        section: "نتیجه‌گیری و ارائه راهکارهای کاربردی و عملیاتی",
        items: [
          "ارائه راهکارهای مناسب در چند گزینه",
          "امکان‌سنجی و ارزیابی اجرای راهکارها با توجه به هزینه‌های مالی و تبعات اجتماعی و دیگر مسائل",
          "اولویت‌بندی و فازبندی اجرایی",
        ],
      },
      {
        section: "خروجی",
        items: ["ارائه گزارش نتایج و تهیه خلاصه مدیریتی"],
      },
    ],
  },
  8: {
    title:
      "شناسایی ظرفیت شهر قم در توسعه زیست‌بوم نوآوری، بررسی تاثیر فعال‌سازی ظرفیت این زیست‌بوم برای ایجاد تحول شهری و ارائه راه‌کارهای مناسب در این زمینه",
    serviceDetails: [
      {
        section: "کلیات و پیشینه پژوهش",
        items: [
          "بیان مسئله، اهمیت و ضرورت و روش انجام پژوهش",
          "بررسی پیشینه مسئله در شهر قم و وضع موجود",
          "بررسی تجارب دیگر شهرهای داخلی و خارجی",
        ],
      },
      {
        section: "گردآوری اطلاعات و تحلیل مسئله",
        items: [
          "تهیه برنامه کلی تشکیل زیست‌بوم نوآوری در شهر قم",
          "تعیین وظایف هر بخش از مدیریت شهری در این زیست‌بوم",
          "شناسایی نهادهای دولتی و ظرفیت‌های بخش خصوصی و ارائه راهکارهای مناسب برای استفاده بهینه از آن‌ها",
          "تعیین اهداف مورد انتظار و پیش‌بینی چگونگی اثرگذاری آن بر شهر در دوره‌های کوتاه، میان و بلندمدت",
        ],
      },
      {
        section: "نتیجه‌گیری و ارائه راهکارهای کاربردی و عملیاتی",
        items: [
          "امکان‌سنجی و ارزیابی اجرای راهکارها با توجه به هزینه‌های مالی و ابعاد اجتماعی و دیگر مسائل",
          "اولویت‌بندی راهکارها",
          "فازبندی پیاده‌سازی زیست‌بوم از طراحی شاکله تا تشکیل کامل",
        ],
      },
      {
        section: "خروجی",
        items: ["ارائه گزارش نتایج و تهیه خلاصه مدیریتی"],
      },
    ],
  },
  9: {
    title: "بررسی شیوه‌های جمع‌آوری تاریخ‌شفاهی و ارائه کاربردی آن در شهر قم",
    serviceDetails: [
      {
        section: "کلیات و پیشینۀ پژوهش",
        items: [
          "بیان مسئله، اهمیت و ضرورت و روش انجام پژوهش",
          "بررسی پیشینۀ مسئله در شهر قم و وضع موجود",
          "بررسی تجارب دیگر شهرهای داخلی و خارجی",
        ],
      },
      {
        section: "گردآوری اطلاعات و تحلیل مسئله",
        items: [
          "تبیین اهمیت جمع‌آوری تاریخ‌شفاهی و تأثیر آن در صورت استفاده مناسب",
          "تعیین جزئیات مطالعات و اقدامات مورد نیاز برای تدوین این برنامه",
          "فازبندی اجرای اقدامات برای تهیه و تکمیل برنامه",
        ],
      },
      {
        section: "نتیجه‌گیری و ارائه راهکارهای کاربردی و عملیاتی",
        items: [
          "پیشنهاد اصلی برنامه جامع جمع‌آوری تاریخ‌شفاهی",
          "امکان‌سنجی و ارزیابی اجرای راهکارها با توجه به هزینه‌های مالی و تبعات اجتماعی و دیگر مسائل",
          "اولویت‌بندی راهکارها",
        ],
      },
      {
        section: "خروجی",
        items: ["ارائه گزارش نتایج و تهیه خلاصۀ مدیریتی"],
      },
    ],
  },
  10: {
    title: "بررسی نقش و وظایف مدیریت شهری قم در شکل‌گیری تمدن اسلامی",
    serviceDetails: [
      {
        section: "کلیات و پیشینه پژوهش",
        items: [
          "بیان مسئله، اهمیت و ضرورت و روش انجام پژوهش",
          "بررسی پیشینه مسئله در شهر قم و وضع موجود",
          "بررسی تجارب دیگر شهرهای داخلی و خارجی",
        ],
      },
      {
        section: "گردآوری اطلاعات و تحلیل مسئله",
        items: [
          "تبیین مفهوم تمدن اسلامی و تعیین نقش آن برای کشور",
          "تعیین نقش شهر قم در این تمدن و جایگاه ایده‌آل آن با رویکرد مدیریت شهری",
          "بررسی نقش و ظرفیت مدیریت شهری در دستیابی شهر به جایگاه مورد نظر",
          "پیشنهاد سازوکار ارتباطی مناسب برای تعامل بین مدیریت شهری و نهادهای دینی با هدف استفاده بهینه از ظرفیت‌ها",
          "تعیین اهداف مورد انتظار و پیش‌بینی چگونگی اثرگذاری آن بر شهر در دوره‌های کوتاه، میان و بلندمدت",
        ],
      },
      {
        section: "نتیجه‌گیری و ارائه راهکارهای کاربردی و عملیاتی",
        items: [
          "ارائه راهکارهای مناسب در چند گزینه",
          "امکان‌سنجی و ارزیابی اجرای راهکارها با توجه به هزینه‌های مالی و تبعات اجتماعی و دیگر مسائل",
          "اولویت‌بندی راهکارها",
          "تهیه فهرست نهادهای دینی شهر قم و وظایف هر یک و دیگر مشخصات مورد نیاز",
        ],
      },
      {
        section: "خروجی",
        items: ["ارائه گزارش نتایج و تهیه خلاصه مدیریتی"],
      },
    ],
  },

  11: {
    title:
      "بررسی راهکارهای ارتقاء مشارکت فرهنگی اجتماعی نهادها و مراکز فعال فرهنگی",
    serviceDetails: [
      {
        section: "کلیات و پیشینه پژوهش",
        items: [
          "بیان مسئله، اهمیت و ضرورت و روش انجام پژوهش",
          "بررسی پیشینه مسئله در شهر قم و وضع موجود",
          "بررسی تجارب دیگر شهرهای داخلی و خارجی",
        ],
      },
      {
        section: "گردآوری اطلاعات و تحلیل مسئله",
        items: [
          "تهیه فهرست از نهادها و مراکز فعال فرهنگی شهر قم",
          "بررسی نیازها و ظرفیت‌های هر یک از مراکز فعال فرهنگی",
          "سازوکار ارتباطی مناسب برای تعامل بین مدیریت شهری و مراکز فعال فرهنگی با توجه به استفاده بهینه از ظرفیت‌های متقابل",
        ],
      },
      {
        section: "نتیجه‌گیری و ارائه راهکارهای کاربردی و عملیاتی",
        items: [
          "ارائه راهکارهای مناسب با ایجاد گزینه‌های متعدد",
          "امکان‌سنجی و ارزیابی اجرای راهکارها با توجه به هزینه‌های مالی و تبعات اجتماعی و دیگر مسائل",
          "اولویت‌بندی راهکارها",
        ],
      },
      {
        section: "خروجی",
        items: ["ارائه گزارش نتایج و تهیه خلاصه مدیریتی"],
      },
    ],
    توضیحات: "شرح خدمات پژوهش",
  },
  12: {
    title: "بررسی راهکارهای ارتقاء امید و نشاط در شهر قم",
    serviceDetails: [
      {
        section: "کلیات و پیشینه پژوهش",
        items: [
          "بیان مسئله، اهمیت و ضرورت و روش انجام پژوهش",
          "بررسی پیشینه مسئله در شهر قم و وضع موجود",
          "بررسی تجارب دیگر شهرهای داخلی و خارجی",
        ],
      },
      {
        section: "گردآوری اطلاعات و تحلیل مسئله",
        items: [
          "بررسی وضعیت موجود نشاط اجتماعی و امید در مناطق هشتگانه شهر قم",
          "بررسی چگونگی گذران اوقات فراغت شهروندان قمی",
          "سنجش شاخصه‌های مرتبط با نشاط شهری برای شهر قم",
          "بررسی نیازهای نشاط لور و امیدآفرین برای شهروندان",
          "ارائة راهکارهای اجرایی جهت افزایش نشاط عمومی با استفاده از ظرفیت‌های مدیریت شهرک قم",
        ],
      },
      {
        section: "نتیجه گیری و ارائه راهکارهای کاربردی و عملیاتی",
        items: [
          "ارائة راهکارهای مناسب در چند گزینه",
          "امکان‌سنجی و ارزیابی اجرای راهکارها با توجه به هزینه‌های مالی و تبعات اجتماعی و دیگر مسائل",
          "اولویت‌بندی راهکارها",
        ],
      },
      {
        section: "خروجی",
        items: ["ارائه گزارش نتایج و تهیه خلاصه مدیریتی"],
      },
    ],
  },
  13: {
    title: "تحلیل اثرگذاری رسانه‌های مختلف بر شهروندان قمی",
    serviceDetails: [
      {
        section: "اهداف تحقیق",
        items: [
          "هدف اصلی: تحلیل اثرگذاری رسانه‌های مختلف بر اقتدار مختلف شهروندان و نحوه دسترسی شهروندان به اخبار و اطلاعات است تا زمینه حضور موثر شهرداری قم در حوزه الرسانه فراهم گردد.",
          "تحلیل مصرف رسانه‌ای شهروندان قمی",
          "تبیین دایره مخاطبان از گروه‌های هدف",
          "آسیب‌شناسی و ارزیابی فعالیت‌های اطلاع‌رسانی در شهر قم",
          "بررسی میزان اثرگذاری و اطمینان شهروندان به رسانه‌ها (صداوسیسا) نشریات استانی و ملی/ خبرگزاری‌ها و نبات‌های خبری استانی و ملی/رسانه‌های نوین( تبلیغات محیطی)",
          "بررسی رابطه مصرف رسانه‌ای شهروندان قمی و مشارکت شهروندی",
          "تبیین وضعیت مصرف رسانه‌ای شهروندان قمی در یک دهه آینده",
        ],
      },
      {
        section: "شرح خدمات",
        items: [
          "الف) مطالعات اکتشافی بافت و زمینه",
          "تبیین مصرف رسانه‌ای مردم قم به تفکیک مناطق مختلف شهری (با روان مطالعات پیمایشی)",
          "تبیین کانال‌های ارتباطی موجود در شهر قم",
          "شناسایی کانال‌های ارتباطی با اتفاقیت قابل توجه که امروز استفاده قرار نگرفته است.",
          "ب) طبقه‌بندی مخاطبین در هر کانال اطلاع‌رسانی",
          "احصای میزان مخاطب پیام‌های ارتباطی در بسترهای مختلف اطلاع‌رسانی",
          "تبیین پر مخاطب‌ترین کانال‌های اطلاع‌رسانی",
          "تبیین اثرگذارترین کانال‌های ارتباطی",
          "تبیین نقاط قوت و ضعف اثرگذاری رسانه‌ای",
        ],
      },
    ],
  },
  14: {
    title:
      "ارائه راهکارهای بهبود رفتار ترافیکی شهروندان، افزایش ایمنی معابر و کاهش سوانح رانندگی شهر قم",
    serviceDetails: [
      {
        section: "کلیات و پیشینه پژوهش",
        items: [
          "بیان مسئله، اهمیت و ضرورت و روش انجام پژوهش",
          "بررسی پیشینه مسئله در شهر قم و وضع موجود",
          "بررسی تجارب دیگر شهرهای داخلی و خارجی",
        ],
      },
      {
        section: "گردآوری اطلاعات و تحلیل مسئله",
        items: [
          "بررسی مهمترین و پرتکرارترین تخلفات رانندگی در شهر قم و سنجش کلی آثار هریک",
          "بررسی مهمترین علت سوانح رانندگی در شهر قم به تفکیک شدت حادثه",
          "بررسی چگونگی و میزان اعمال قانون خودروهای مختلف از طریق مختلف شامل اجرای تخلفات",
          "شناسایی مشکلات پیش روی اعمال قانون خودروها و پیشنهاد راهکار در زمینه های مختلف",
          "تعیین اهداف مورد انتظار و پیش بینی چگونگی اثرگذاری آن بر شهر در دوره های کوتاه، میان و بلندمدت",
        ],
      },
      {
        section: "نتیجه گیری و ارائه راهکارهای کاربردی و عملیاتی",
        items: [
          "ارائه راهکارهای مناسب در چند گزینه",
          "امکان سنجی و ارزیابی اجرای راهکارها با توجه به هزینه های مالی و تبعات اجتماعی و دیگر مسائل",
          "اولویت بندی راهکارها",
        ],
      },
      {
        section: "خروجی",
        items: ["ارائه گزارش نتایج و تهیه خلاصۀ مدیریتی"],
      },
    ],
  },
  15: {
    title:
      "ارائه راهکارهای توانمندسازی محلات شهر قم و گسترش مشارکت شهروندان با استفاده از ظرفیت سراهای محله",
    serviceDetails: [
      {
        section: "کلیات و پیشینه پژوهش",
        items: [
          "بیان مسئله، اهمیت و ضرورت و روش انجام پژوهش",
          "بازرسی پیشینه مسئله در شهر قم و وضع موجود",
          "بررسی تجارب دیگر شهرهای داخلی و خارجی",
        ],
      },
      {
        section: "گردآوری اطلاعات و تحلیل مسئله",
        items: [
          "بررسی مسائل شهری محلات شهر قم",
          "تبیین مفهوم محله والطباق آن با شرایط شهر قم و بازتعریف محدودۀ محلات",
          "بررسی و ظرفیت سنجی توانمندی های محلات شهر قم بصورت موردی",
          "تعیین اهداف مورد انتظار و پیش بینی چگونگی اثرگذاری آن بر شهر در دوره‌های کوتاه، میان و بلندمدت",
          "چگونگی استفاده از ظرفیت سراهای محله جهت مشارکت شهروندان",
          "نتایج مشارکت شهروندان درسراهای محله",
          "امکان‌سنجی و ارزیابی اجرای راهکارها با توجه به هزینه‌های مالی و تبعات اجتماعی و دیگر مسائل",
          "روش‌های ترغیب و استقبال شهروندان جهت مشارکت در توانمند سازی محلات",
        ],
      },
      {
        section: "نتیجه گیری و ارائه راهکارهای کاربردی و عملیاتی",
        items: [
          "ارائه راهکارهای مناسب جهان تحقق جداکثری شاخصه‌های مورد نظر بر محلات تعریف‌شده",
          "اولویت‌بندی راهکارها",
          "فازبندی اجرا با انتخاب یک محله به‌عنوان پایلوت",
        ],
      },
      {
        section: "خروجی",
        items: ["ارائه گزارش نتایج و تهیه خلاصۀ مدیریتی"],
      },
    ],
  },
};

function useIsMobile() {
  const [isMobile, setIsMobile] = useState(false); // ← مقدار اولیه ثابت

  useEffect(() => {
    const checkMobile = () => setIsMobile(window.innerWidth < 1024);
    checkMobile(); // ← بررسی اولیه بعد از mount
    window.addEventListener("resize", checkMobile);
    return () => window.removeEventListener("resize", checkMobile);
  }, []);

  return isMobile;
}

function Subtopics() {
  const { id } = useParams();
  const topic = topicsDetails[id];
  const isMobile = useIsMobile();

  if (!topic)
    return (
      <div className="p-6 text-center text-red-600 font-medium" dir="rtl">
        موضوعی یافت نشد.
      </div>
    );

  return (
    <div className="bg-gray-50 min-h-screen overflow-x-hidden w-full" dir="rtl">
      <div className="p-4 sm:p-6 max-w-6xl mx-auto">
        <h1 className="text-2xl font-bold mb-6 text-right text-green-700">
          {topic.title}
        </h1>

        {/* نمایش دینامیک بر اساس اندازه صفحه */}
        {isMobile ? (
          // کارت‌ها برای موبایل
          <div className="grid gap-4 mt-6">
            {topic.serviceDetails.map((s, i) => (
              <div
                key={i}
                className="bg-white p-4 rounded-xl border border-slate-200 shadow-sm"
              >
                <h2 className="text-base font-bold mb-2 text-right text-green-700">
                  {s.section}
                </h2>
                <ul className="list-disc pr-5 space-y-1 text-sm leading-relaxed text-gray-700 text-right">
                  {s.items.map((item, j) => (
                    <li key={j}>{item}</li>
                  ))}
                </ul>
              </div>
            ))}
          </div>
        ) : (
          // جدول برای دسکتاپ
          <div className="bg-white p-4 rounded-xl border border-slate-100 shadow-sm overflow-x-auto">
            <table className="min-w-full border-collapse text-sm">
              <thead>
                <tr className="bg-slate-100">
                  <th className="px-3 py-2 font-medium border-b border-slate-200 text-right whitespace-nowrap">
                    شرح خدمات
                  </th>
                  <th className="px-3 py-2 font-medium border-b border-slate-200 text-right whitespace-nowrap">
                    جزئیات
                  </th>
                </tr>
              </thead>
              <tbody>
                {topic.serviceDetails.map((s, i) => (
                  <tr
                    key={i}
                    className="hover:bg-slate-50 even:bg-white odd:bg-slate-50 align-top"
                  >
                    <td className="px-3 py-3 border-b border-slate-100 font-semibold text-right whitespace-nowrap">
                      {s.section}
                    </td>
                    <td className="px-3 py-3 border-b border-slate-100 leading-relaxed">
                      <ul className="list-disc pr-5 space-y-1">
                        {s.items.map((item, j) => (
                          <li key={j}>{item}</li>
                        ))}
                      </ul>
                    </td>
                  </tr>
                ))}
              </tbody>
            </table>
          </div>
        )}
      </div>
    </div>
  );
}

const Subtopic = () => {
  return (
    <div className="overflow-x-hidden min-h-screen bg-gray-50">
      <Navbar />

      <Subtopics />
      <Footer />
    </div>
  );
};

export default Subtopic;
